apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
void rtc_handler(nrfx_rtc_int_type_t int_type)
{

    if (int_type == NRFX_RTC_INT_COMPARE0)
    {
        m_rtc_on_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE1)
    {
        m_rtc_sleep_flag = true;
    }

    else if (int_type == NRFX_RTC_INT_COMPARE2)
    {
        calendar_rtc_handler();
    }
}

void handle_rtc_events(void)
{
    ret_code_t err_code;

    if (m_rtc_on_flag)
    {
        m_rtc_on_flag = false;

        if (m_device_active)
        {
            NRF_LOG_RAW_INFO(
                "\n\n\033[1;31m--------->\033[0m Transicion a \033[1;36mMODO SLEEP\033[0m");

            // Verificar modo actual al ir a sleep
            if (m_reconnection_mode)
            {
                NRF_LOG_RAW_INFO("\n\033[1;33m>>> CONTINUANDO MODO RECONEXION <<<\033[0m");
            }
            else
            {
                // Activar modo reconexión si no se encontró al emisor durante este ciclo
                if (!m_emisor_found_this_cycle)
                {
                    m_reconnection_mode = true;
                    NRF_LOG_RAW_INFO("\n\033[1;33m>>> ACTIVANDO MODO RECONEXION <<<\033[0m");
                    NRF_LOG_RAW_INFO("\n>> Emisor no encontrado durante tiempo normal");
                }
                else
                {
                    // NRF_LOG_RAW_INFO("\n\033[1;32m>>> USANDO MODO NORMAL <<<\033[0m");
                }
            }

            // Resetear la bandera para el próximo ciclo
            m_emisor_found_this_cycle = false;

            disconnect_all_devices();
            advertising_stop();
            scan_stop();
            app_uart_close();
            m_device_active = false;

            // Usar tiempo de sleep específico según el modo
            if (m_reconnection_mode)
            {
                restart_sleep_rtc_reconnection();
            }
            else
            {
                restart_sleep_rtc();
            }
        }
    }

    if (m_rtc_sleep_flag)
    {
        m_rtc_sleep_flag = false;

        if (!m_device_active)
        {
            // Inicializar la bandera de emisor encontrado para este nuevo ciclo
            m_emisor_found_this_cycle = false;

            if (m_reconnection_mode)
            {
                NRF_LOG_RAW_INFO("\n\n\033[1;31m--------->\033[0m Transicion a \033[1;33mMODO "
                                 "ACTIVO (RECONEXION)\033[0m");

                // restart_on_rtc_extended();
            }
            else
            {
                NRF_LOG_RAW_INFO(
                    "\n\n\033[1;31m--------->\033[0m Transicion a \033[1;32mMODO ACTIVO\033[0m");
            }

            // TRATAR DE HACER LOS PROCESOS DE MEMORIA ANTES DE
            // INICIAR EL ADVERTISING Y EL SCANEO

            // Modificar el advertising payload para mostrar
            // los valores de los ADC

            NRF_LOG_RAW_INFO("\n[GUARDADO] Fecha y hora: %04u-%02u-%02u, "
                             "%02u:%02u:%02u",
                             m_time.year,
                             m_time.month,
                             m_time.day,
                             m_time.hour,
                             m_time.minute,
                             m_time.second);

            write_date_to_flash(&m_time);

            advertising_init();

            // fds_print_all_record_times(HISTORY_FILE_ID);

            // Mostrar fecha y hora

            // Actualizar el payload para mostrar los adc_values
            scan_start();
            advertising_start();
            uart_init();
            m_device_active = true;

            // Usar tiempo de encendido específico según el modo
            if (m_reconnection_mode)
            {
                // NRF_LOG_RAW_INFO("\n\033[1;33m>>> USANDO TIEMPO EXTENDIDO (modo reconexion)
                // <<<\033[0m");
                restart_on_rtc_extended();
            }
            else
            {
                // NRF_LOG_RAW_INFO("\n\033[1;32m>>> USANDO TIEMPO NORMAL <<<\033[0m");
                restart_on_rtc();
            }
        }
    }
}

void rtc_init(void)
{
    // Configuración LFCLK mejorada
    nrf_drv_clock_init();
    nrf_drv_clock_lfclk_request(NULL);

    // Esperar a que el reloj esté estable
    while (!nrf_drv_clock_lfclk_is_running())
    {
    }

    // Configurar RTC con prescaler CORRECTO
    nrfx_rtc_config_t config = NRFX_RTC_DEFAULT_CONFIG;
    config.prescaler = RTC_PRESCALER;
    ret_code_t err_code = nrfx_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    // Limpiar contador y comenzar desde cero
    nrfx_rtc_counter_clear(&m_rtc);

    // Configurar comparadores iniciales

    // Solo programar el primer evento de 15s
    nrfx_rtc_cc_set(&m_rtc,
                    0,
                    (read_time_from_flash(TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS) / 1000) * 8,
                    true);

    // Deshabilitar el evento de 20s inicialmente
    nrfx_rtc_cc_disable(&m_rtc, 1);

    // Habilitar interrupciones
    nrfx_rtc_int_enable(&m_rtc,
                        NRF_RTC_INT_COMPARE0_MASK | NRF_RTC_INT_COMPARE1_MASK |
                            NRF_RTC_INT_COMPARE2_MASK);
    nrfx_rtc_enable(&m_rtc);
}

void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

static void base_timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void ble_nus_chars_received_uart_print(uint8_t *p_data, uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

    for (uint32_t i = 0; i < data_len; i++)
    {
        uint32_t timeout_counter = 0;
        do
        {
            ret_val = app_uart_put(p_data[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("app_uart_put failed for index 0x%04x, error: 0x%X", i, ret_val);
                // No hacer crash, solo salir del loop
                break;
            }
            
            // Timeout para evitar loops infinitos
            timeout_counter++;
            if (timeout_counter > 10000) {
                NRF_LOG_WARNING("UART timeout, skipping byte %d", i);
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
    if (p_data[data_len - 1] == '\r')
    {
        while (app_uart_put('\n') == NRF_ERROR_BUSY)
            ;
    }
    if (ECHOBACK_BLE_UART_DATA)
    {
        // Send data back to the peripheral.
        // Esta funcionalidad está deshabilitada para evitar loops
        /*
        do
        {
            ret_val = ble_nus_c_string_send(&m_ble_nus_c, p_data, data_len);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x.", ret_val);
                // No hacer crash en caso de error
                break;
            }
        } while (ret_val == NRF_ERROR_BUSY);
        */
    }
}

static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

