apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event)
    {
    case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
        // Prepare wakeup buttons.
        err_code = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(err_code);
        break;

    default:
        break;
    }

    return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);

static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ret_code_t err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
    case BLE_GAP_EVT_TIMEOUT:
        if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
        {
            NRF_LOG_INFO("Connection Request timed out.");
        }
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported.
        err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle,
                                               BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                               NULL,
                                               NULL);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        // Accepting parameters requested by peer.
        err_code =
            sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                         &p_gap_evt->params.conn_param_update_request.conn_params);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
        NRF_LOG_DEBUG("PHY update request.");
        ble_gap_phys_t const phys = {
            .rx_phys = BLE_GAP_PHY_AUTO,
            .tx_phys = BLE_GAP_PHY_AUTO,
        };
        err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        APP_ERROR_CHECK(err_code);
    }
    break;

    case BLE_GATTC_EVT_TIMEOUT:
        // Disconnect on GATT Client timeout event.
        NRF_LOG_DEBUG("GATT Client Timeout.");
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTS_EVT_TIMEOUT:
        // Disconnect on GATT Server timeout event.
        NRF_LOG_DEBUG("GATT Server Timeout.");
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    default:
        break;
    }

    // Forward BLE events to the app NUS server module
    app_nus_server_ble_evt_handler(p_ble_evt);

    // Forward BLE events to the app NUS client module
    app_nus_client_ble_evt_handler(p_ble_evt);
}

static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        // NRF_LOG_INFO("ATT MTU exchange completed.");

        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        // NRF_LOG_INFO("Ble NUS max data length set to 0x%X(%d)",
        // m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
}

/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}

void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
    case BSP_EVENT_SLEEP:
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
        break;

    case BSP_EVENT_DISCONNECT:
        break;

    default:
        break;
    }
}

static void buttons_leds_init(void)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}

static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

void app_nus_server_on_data_received(const uint8_t *data_ptr, uint16_t data_length)
{
    // // Output the data to the UART
    // NRF_LOG_RAW_INFO("\nServer data received: ");
    // for (int i = 0; i < data_length; i++)
    //     NRF_LOG_RAW_INFO("\n%c", data_ptr[i]);
    // NRF_LOG_RAW_INFO("\n");

    // Forward the data from the client to the server
    app_nus_client_send_data(data_ptr, data_length);
}

// Procesa la información recibida desde el emisor
void app_nus_client_on_data_received(const uint8_t *data_ptr, uint16_t data_length)
{
    uint16_t position = 0;

    // Se recibieron los datos de los ADC's y contador
    if (data_length > 8 && data_ptr[0] == 0x96)
    {
        uint16_t pos = 1;
        adc_values.V1 = (data_ptr[pos] << 8) | data_ptr[pos + 1];
        pos += 2;
        adc_values.V2 = (data_ptr[pos] << 8) | data_ptr[pos + 1];
        pos += 2;
        adc_values.contador = (data_ptr[pos] << 24) | (data_ptr[pos + 1] << 16) |
                              (data_ptr[pos + 2] << 8) | data_ptr[pos + 3];
        if (save_adc_values(&adc_values) != NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n[ERROR] No se pudieron guardar ni cargar los valores de los ADC's");
        }
    }

    // Se recibio el 'ultimo' historial del emisor
    if (data_length > 20 && data_ptr[0] == 0x08)
    {
        position = 1; // Comenzar después del primer byte
        // Desempaquetar datos
        uint8_t day = data_ptr[position++];
        uint8_t month = data_ptr[position++];
        uint16_t year = (data_ptr[position++] << 8) | data_ptr[position++];
        uint8_t hour = data_ptr[position++];
        uint8_t minute = data_ptr[position++];
        uint8_t second = data_ptr[position++];
        uint32_t contador = (data_ptr[position++] << 24) | (data_ptr[position++] << 16) |
                            (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V1 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V2 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint8_t battery = data_ptr[position++];
        position += 6; // MAC original
        position += 6; // MAC custom
        uint16_t V3 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V4 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V5 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V6 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V7 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint16_t V8 = (data_ptr[position++] << 8) | data_ptr[position++];
        uint8_t temp = data_ptr[position++]; // Temperatura del módulo
        uint16_t last_position = (data_ptr[position++] << 8) | data_ptr[position++];

