apemangr/Repetidor-nRF52-SDK-17.1.0/main.c
        // Construir el registro temporal
        store_history nuevo_historial = {.year = year,
                                         .month = month,
                                         .day = day,
                                         .hour = hour,
                                         .minute = minute,
                                         .second = second,
                                         .contador = contador,
                                         .V1 = V1,
                                         .V2 = V2,
                                         .V3 = V3,
                                         .V4 = V4,
                                         .V5 = V5,
                                         .V6 = V6,
                                         .V7 = V7,
                                         .V8 = V8,
                                         .temp = temp,
                                         .battery = battery};

        // Guardar el historial recibido en la posición indicada
        ret_code_t ret = save_history_record_emisor(&nuevo_historial, last_position);
        if (ret != NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nError al guardar historial en posicion: %u (ret=%d)\n",
                             last_position,
                             ret);
        }

        // Imprimir usando print_history_record con el número de historial en el
        // título
        char titulo[41];
        snprintf(titulo, sizeof(titulo), "Historial recibido \x1B[33m#%u\x1B[0m", last_position);
        print_history_record(&nuevo_historial, titulo);
        // fds_print_all_record_times();
        NRF_LOG_FLUSH();
    }
    app_nus_server_send_data(data_ptr, data_length);
}

static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        if (!m_device_active)
        {
            nrf_pwr_mgmt_run();
        }
        else
        {
            sd_app_evt_wait();
        }
    }
}

int main(void)
{

    ret_code_t err_code;
    log_init();
    NRF_LOG_RAW_INFO("\n\033[1;36m====================\033[0m "
                     "\033[1;33mINICIO DEL SISTEMA\033[0m"
                     " \033[1;36m====================\033[0m\n");
    NRF_LOG_RAW_INFO("\t\t Firmware 0.0.1 por\033[0m "
                     "\033[1;90mCrea\033[1;31mLab\033[0m\n\n");

    base_timer_init();
    fds_initialize();
    rtc_init();
    uart_init();
    buttons_leds_init();
    power_management_init();

    ble_stack_init();
    gatt_init();

    load_adc_values(&adc_values);
    load_repeater_configuration(&config_repetidor, 0, 0, 1);

    // Inicializa los servicios de servidor y cliente NUS
    app_nus_server_init(app_nus_server_on_data_received);
    app_nus_client_init(app_nus_client_on_data_received);

    calendar_init();

    NRF_LOG_FLUSH();
    calendar_set_datetime();

    NRF_LOG_RAW_INFO("\n\033[1;31m>\033[0m Buscando emisor...\n");
    NRF_LOG_FLUSH();

    // Enter main loop.
    for (;;)
    {
        calendar_update();
        handle_rtc_events();
        idle_state_handle();
    }
}
